//-------------------------------------------------------------------------
// 文件: ErrorReport.h
// 时间: 2005-12-19 10:43
// 作者: 游戏行业很多兄弟奋斗的积累
// 名称: 错误报告与发送
// 版本:
// [v1.0]2005-12-19 10:43:初始版本
// [v1.1]2005-12-20 14:09:添加了一个主对话框
// [v1.2]2005-12-23 15:01:参照UE的显示，添加了二进制显示功能
// [v1.3]2006-01-04 20:23:更改了Win9X的文件兼容性问题
// [v1.4]2006-01-12 18:23:添加了文件预览的UTF8支持
// [v1.5]2006-03-07 16:31:更改了部分界面显示
//-------------------------------------------------------------------------
#pragma once
#ifndef ErrorReport_h_
#define ErrorReport_h_

namespace ErrorReport {

//-------------------------------------------------------------------------
// 函数: void RegisterLogFiles( LPCTSTR szLogFile )
// 说明: 注册日志文件，将日志添加在发送列表，以便在错误发生时发送
// 参数: szLogFile			日志文件名
// 返回: 无
//-------------------------------------------------------------------------
void RegisterLogFiles( LPCTSTR szLogFile );

//-------------------------------------------------------------------------
// 函数: void UnRegisterLogFiles( LPCTSTR szLogFile )
// 说明: 取消对某个日志文件的注册
// 参数: szLogFile			日志文件名
// 返回: 无
//-------------------------------------------------------------------------
void UnRegisterLogFiles( LPCTSTR szLogFile );

//-------------------------------------------------------------------------
// 函数: BOOL DisplayErrorDlg( IN PEXCEPTION_POINTERS pException )
// 说明: 显示错误对话框，这个函数中的文件列表取自RegisterLogFiles
// 参数: pException			异常指针（如果为空则不自动生成dmp和md文件）
// 返回: 是否用户选择了发送
//-------------------------------------------------------------------------
BOOL DisplayErrorDlg( IN PEXCEPTION_POINTERS pException );

};

#endif//ErrorReport_h_
